"""
Из определенного листового материала необходимо выкроить 360 заготовок типа А, 300 заготовок типа Б и 675 заготовок типа В. При этом можно применять три способа раскроя.

Количество заготовок, получаемых из каждого листа при каждом способе раскроя, указано в таблице:



Найдите решение задачи, при котором расход материала и отходы окажутся минимальными.

Важно:

●	Для решения используйте модуль linalg библиотеки NumPy.

●	Ответом должен быть массив NumPy из чисел листов, необходимых на раскрой первым, вторым и третьим способом соответственно.

●	Воспользуйтесь следующей системой уравнений:

3x+2y+z=360
x+6y+2z=300
4x+y+5z=675

"""
import numpy as np

# запишите здесь ваше решение

# print(answer)