"""
В этом задании вам необходимо реализовать алгоритм МНК (метод наименьших квадратов) в виде функции с использованием библиотеки numpy:

def mnk(x_,y_):
    …
    return a,b

Входные данные:

●     x_: временной ряд x длиной 30 точек, сгенерированный с помощью функции linspace;

●     y_: временной ряд y длиной 30 точек, сгенерированный с помощью функции linspace с коэффициентами a и b.

Написанная функция должна возвращать коэффициенты a и b функции линейной аппроксимации (y = ax + b).
"""


def mnk(x_, y_):
    # запишите далее ваш код
    pass
    # return a,b
