"""
Ваш коллега создал структуру данных (см. окно ввода ответа) и передал вам в работу. Преобразуйте ее в
массив NumPy и выполните следующие задания:

1.	Создайте подмассив lines, содержащий все строки со 2-й по 4-ю включительно.

2.	Создайте подмассив last_column, содержащий последний столбец исходного массива.

3.	Транспонируйте исходный массив и сохраните результат в переменную array_t.

4.	Вычислите сумму элементов исходного массива, результат сохраните в переменную array_sum.

5.	Вычислите среднее значение элементов исходного массива, результат сохраните в переменную array_avg.

Обратите внимание: в заданиях не требуется выполнять вывод полученных результатов на экран. Для
выполнения заданий 2.2–2.5 используйте функции библиотеки NumPy.
"""